# 기술면접 준비

## Primitive Type & Wrapper Class

### Primitive Type 이란?

Primitive Type은 우리가 일반적으로 Type을 선언 해줄 때
사용하는 기본적인 타입을 의미한다.

ex) `short, int, long, float, double, byte, char, boolean`

### Wrapper Class

Wrapper class 는 타입이 객체안에 담겨있는 __클래스__ 다.

List를 사용할 때 `List<int>`로 선언하지 않는다. 안될 뿐더러 기본형 타입의 List를 만드는 것은 매우 복잡한 일이기 때문이다.

따라서 이 기본적인 타입을 객체로 감싸서 사용하는 것이 Wrapper Class이다.

사용하기에는 용이하지만, Wrapper Class는 객체이다보니 생성하는 과정에 있어 비용이 들기 때문에 기본형을 대신해서 사용하진 않는다.

<hr>

## 객체지향

### 객체 지향 특징

- 추상화
- 캡슐화
- 상속
- **다형성**

### 객체 지향 프로그래밍

- 객체 지향 프로그래밍은 컴퓨터 프로그램을 명령어의 목록으로 보는 시각에서 벗어나 여러 개의 사물과 개념이 독립된 단위가 “**객체**”이며, 이 "**객체**"들의 모임 속에서 각각 일어나는 **객체**끼리 **메시지**를 주고받으며 데이터를 처리(**협력**)하도록 지향하는 것이다.
- 객체 지향 프로그래밍은 프로그램을 **유연**하고 **변경**이 **용이**하게 만들기 때문에 대규모 소프트웨어 개발에 많이 사용된다.